app/views/homes/questionnaire.html.erb

SELECT question_answers.*,questions.*,answers.* FROM "question_answers" INNER JOIN "questions" ON "questions"."id" = "question_answers"."question_id" INNER JOIN "answers" ON "answers"."id" = "question_answers"."answer_id" WHERE (question_answers(question_id as integer) LIKE '%4%')
---
                 <div class="col-md-10 col-sm-12">
                   <% @answer = QuestionAnswer.where('question_answers.question_id' => question.id).joins(:answer) %>