app/controllers/homes_controller.rb

SELECT .* FROM "questions" WHERE ("questions"."id" BETWEEN ? AND ?) ORDER BY order ASC  [["id", 1], ["id", 3]]
---
  def questionnaire

    #Question.where(:id => start..stop).order('order ASC').select(:name)
    if !session[:count_youdo]
      session[:count_youdo] = 1
      @subheader = "ก่อนการเยี่ยมชม"
      @question = Question.where(:id => 1..3)

SELECT COUNT(*) FROM "questions"
INSERT INTO "q_items" ("created_at", "updated_at", "user_id", "question_id", "answer_id", "value") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2018-04-22 02:41:14.254033"], ["updated_at", "2018-04-22 02:41:14.254033"], ["user_id", 7], ["question_id", 4], ["answer_id", 16], ["value", "16"]]
---
  def new_questionnaire

    #if self.success == true
      @start = 0
      while @start < Question.count
        @start += 1
        q = "q"+@start.to_s
        question_id = params[:form_questionnaire][:question_id][q]
        answer_id = params[:form_questionnaire][:choice][q]
        q_item = QItem.new(
          :user_id => current_user.id,
          :answer_id => answer_id,
          :question_id => question_id
          )
        q_item.save