app/controllers/homes_controller.rb

  def new_register
    @player = Player.create(register_params)
---
INSERT INTO "players" ("name", "phone", "occupation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["phone", ""], ["occupation", 3], ["created_at", "2018-04-28 11:24:40.049240"], ["updated_at", "2018-04-28 11:24:40.049240"]]

  def questionnaire

    #Question.where(:id => start..stop).order('order ASC').select(:name)
    if !session[:count_youdo]
      session[:count_youdo] = 1
      @subheader = "ก่อนการเยี่ยมชม"
      @question = Question.where(:id => 1..3).order(:order)
---
SELECT "questions".* FROM "questions" WHERE ("questions"."id" BETWEEN $1 AND $2) ORDER BY "questions"."order" ASC  [["id", 1], ["id", 3]]