app/controllers/question_answers_controller.rb

SELECT  "question_answers".* FROM "question_answers" WHERE "question_answers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "question_answers" WHERE "question_answers"."id" = ?  [["id", 7]]
---
  def show
      @questionAnswer = QuestionAnswer.find( params[:id] )
      @questionAnswer.destroy