app/controllers/questions_controller.rb

    def index
        #@question = QuestionAnswer.select('question_answers.*,questions.name AS question_name').joins(:question)
        @question = Question.all
---
SELECT "questions".* FROM "questions"

    def show
        @question = Question.find(params[:id])
        @answer = QuestionAnswer.where("question_answers.question_id like ?", "%#{params[:id]}%").select('question_answers.*,questions.*,answers.*').joins(:question,:answer)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT question_answers.*,questions.name AS question_name,answers.name AS answer_name FROM "question_answers" INNER JOIN "questions" ON "questions"."id" = "question_answers"."question_id" INNER JOIN "answers" ON "answers"."id" = "question_answers"."answer_id" WHERE (question_answers.question_id like '%1%')